CSI API ETABS v1

# cLineElmGetEndLengthOffset Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetEndLengthOffset(
    	string Name,
    	ref double Length1,
    	ref double Length2,
    	ref double RZ
    )

    Function GetEndLengthOffset (
    	Name As String,
    	ByRef Length1 As Double,
    	ByRef Length2 As Double,
    	ByRef RZ As Double
    ) As Integer

    Dim instance As cLineElm
    Dim Name As String
    Dim Length1 As Double
    Dim Length2 As Double
    Dim RZ As Double
    Dim returnValue As Integer

    returnValue = instance.GetEndLengthOffset(Name,
    	Length1, Length2, RZ)

    int GetEndLengthOffset(
    	String^ Name,
    	double% Length1,
    	double% Length2,
    	double% RZ
    )

    abstract GetEndLengthOffset :
            Name : string *
            Length1 : float byref *
            Length2 : float byref *
            RZ : float byref -> int

#### Parameters

Name

    Type: SystemString

Length1

    Type: SystemDouble

Length2

    Type: SystemDouble

RZ

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cLineElm Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com